XmppTransport/src/test/resources/test-message.xml

<soap:Envelope xmlns:soap='http://www.w3.org/2003/05/soap-envelope'>
   <soap:Body>
     <test:sayHi xmlns:test='http://service.xmpp.test/'>
          <arg0>World</arg0>
     </test:sayHi>
   </soap:Body>
</soap:Envelope>
